<!-- dflook/terraform-github-actions {"workspace":"output-2","backend":"c64f0d3d034692266d26d81399bad7d218c417ec8e3e4e125bb8cd240762d10c","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #65 at https://github.com/dflook/terraform-github-actions/actions/runs/3235515053","plan_hash":"edfcac75cef65adcf840ca8afedab49eb9b56b68f18320706a4a64bdb05ed61c","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __output-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #65](https://github.com/dflook/terraform-github-actions/actions/runs/3235515053)